In [1]:
#
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from numpy import nan as NA
import sys

In [2]:
#
import matplotlib.pylab as plt
from numpy.random import randn
%matplotlib inline

# Chapter 5: Getting Started with pandas

In [3]:
#
import pandas as pd
from pandas import Series, DataFrame

Create a series named "obj" by a list of [4, 7, -5, 3]

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

convert obj to an array and return as arr

In [5]:
arr = obj.values
arr

array([ 4,  7, -5,  3])

Return the index of obj

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Creat a series obj2 by a list of [4, 7, -5, 3] and index ['d', 'b', 'a', 'c']

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

Return the value with index 'c' and 'a'

In [9]:
obj2.loc[['c', 'a']]

c    3
a   -5
dtype: int64

Return elements larger than 0 in obj2

In [10]:
obj2.loc[obj2 > 0]

d    4
b    7
c    3
dtype: int64

Create a series obj3 from a dict sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

Run the following line and verify you expectation

In [12]:
#
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Use a pd function to check the NaN in obj4

In [13]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Run the following line and verify your expectation

In [14]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Name obj 4 as "population" and name its index as "State"

In [15]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

Assign new index ['Bob', 'Steve', 'Jeff', 'Ryan'] to obj

In [16]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [17]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

Run next cell to create a dict data

In [18]:
#
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

Create a DataFrame frame by dict data

In [19]:
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

Run the following line and verify your expectation

In [20]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                  index = ['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

Return the column names of frame2

In [21]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Run next cell to create a Series val

In [22]:
#
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

Assign val to frame2.debt

In [23]:
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Check whether the state in each row is "Ohio", and append the result to frame2 as a new column 'eastern'

In [24]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

Delete the column of 'eastern'

In [25]:
frame2.drop('eastern', inplace=True, axis=1)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Run the following code to create frame3

In [26]:
#
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, \
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

Give frame3 a column name of 'state' and an index name of 'year'

In [27]:
frame3.columns.name = 'state'
frame3.index.name = 'year'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

Run next cell to create a series obj

In [28]:
#
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Reindex obj2 by ['a', 'b', 'c', 'd', 'e'], and fill missing values by 0, and ruturn the result as obj2

In [29]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

Run next cell to create a series obj3

In [30]:
#
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

Reindx obj3 by range(6) and forward-fill the missing values

In [31]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Run next cell to create DataFrame 'frame'

In [32]:
# 
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

Reindex frame2 by ['a', 'b', 'c', 'd'] and return as frame2

In [33]:
frame2 = frame.reindex(index = ['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Now re-column frame by ['Texas', 'Utah', 'California']

In [34]:
frame.reindex(columns=['Texas', 'Utah', 'California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

reindex and re-column frame (combine the two steps above), and forward fill the missing values

In [35]:
frame.reindex(index = ['a', 'b', 'c', 'd'],
              columns=['Texas', 'Utah', 'California']).fillna(method = 'ffill')

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

Run next line to create "data".

In [36]:
#
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Then return the columns of 'three' and 'one' from data

In [37]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Return all rows where column 'three' is larger than 5

In [38]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Label-based indexing: return the rows of 'Colorado' and 'New York' and keep only the columns of 'one' and 'three'

In [39]:
data.loc[['Colorado', 'New York']][['one', 'three']]

          one  three
Colorado    4      6
New York   12     14

Position-based indexing, return the first two rows of data

In [40]:
data.iloc[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [41]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Return the second row of data

In [42]:
data.iloc[1, :]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

Run the first column of data

In [43]:
data.iloc[:, 0]

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

Run next cell to create df1 and df2

In [44]:
#
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [45]:
#
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Add df1 and df2. And fill missing values by 0.

In [46]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Run next two cells to create frame and series

In [47]:
#
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [48]:
#
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

Compute frame - series, where index/column should match

In [49]:
frame.sub(series, axis = 1)

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

Run next cell to create a function f and a DataFrame frame

In [50]:
#
f = lambda x: x.max() - x.min()
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.719477 -0.009643 -1.173349
Ohio   -0.133945  0.758520  0.740288
Texas   2.275117  0.634155 -0.823275
Oregon -0.696617 -0.884872  0.106172

Apply function f each row of frame, and then apply to each column of frame

In [51]:
frame.apply(f, axis = 1)

Utah      1.163706
Ohio      0.892466
Texas     3.098392
Oregon    0.991044
dtype: float64

In [52]:
frame.apply(f)

b    2.994595
d    1.643392
e    1.913637
dtype: float64

Code a function and apply it to frame to return a DataFrame of the min and max value of each state

In [53]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])
frame.apply(f, axis = 1)

             min       max
Utah   -1.173349 -0.009643
Ohio   -0.133945  0.758520
Texas  -0.823275  2.275117
Oregon -0.884872  0.106172

Code a function and apply it to frame so that each element in frame keeps only two decimals

In [54]:
def f(x):
    return '{:.2f}'.format(x)
frame.applymap(f)

            b      d      e
Utah    -0.72  -0.01  -1.17
Ohio    -0.13   0.76   0.74
Texas    2.28   0.63  -0.82
Oregon  -0.70  -0.88   0.11

Run next cell to create a series obj

In [55]:
#
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

Sort Series obj by index

In [56]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

Run next cell to create a DataFrame frame

In [57]:
#
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

Sort frame by index. Then sort it by column.

In [58]:
frame.sort_index(axis = 0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [59]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

Sort frame by column in descending order

In [60]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

Run next cell to create a series obj

In [61]:
#
obj = Series([4, 7, -3, 2])

Now sort obj by values

In [62]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Run next cell to create frame

In [63]:
#
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

Sort frame by the value of 'b'

In [64]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

Run next cell to create obj

In [65]:
#
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

Rank obj (Get the ordinal number). For two same elements, the one shows ealier should have lower rank

In [66]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Run next cell to create 'frame'

In [67]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

Rank frame along row and column, respectively

In [68]:
frame.rank(axis=0)

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [69]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

Run next cell to create 'df'

In [70]:
#
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calculate the mean of each row in df. Do not skip NaN. So if one line has a NaN element, the mean would be NaN

In [71]:
df.mean(axis = 1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Return the index of max and min value in each column of df

In [72]:
df.idxmax(axis=0)

one    b
two    d
dtype: object

In [73]:
df.idxmin(axis=0)

one    d
two    b
dtype: object

Compute the cumulative sum of df along each column

In [74]:
df.cumsum(axis=0)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Run the next two cells to create a DataFrame returns

In [75]:
#
from pandas_datareader import data
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOGL']:
    all_data[ticker] = data.get_data_google(ticker, '1/1/2010', '1/1/2015')

/home/chris/tf/lib/python3.5/site-packages/pandas_datareader/google/daily.py:40: UnstableAPIWarning:
The Google Finance API has not been stable since late 2017. Requests seem
to fail at random. Failure is especially common when bulk downloading.

  warnings.warn(UNSTABLE_WARNING, UnstableAPIWarning)

In [76]:
#
price = DataFrame({tic: data['Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})
returns = price.pct_change()

For returns, calculate the correlation and covariance of MSFT and IBM

In [77]:
returns.MSFT.corr(returns.IBM)

0.4962480124606498

In [78]:
returns.MSFT.cov(returns.IBM)

8.126217520697738e-05

Compute the correlation matrix of returns

In [79]:
returns.corr()

           AAPL     GOOGL       IBM      MSFT
AAPL   1.000000  0.412414  0.373477  0.341865
GOOGL  0.412414  1.000000  0.408194  0.419659
IBM    0.373477  0.408194  1.000000  0.496248
MSFT   0.341865  0.419659  0.496248  1.000000

Compute the correlation of IBM with all stocks

In [80]:
returns.corrwith(returns.IBM)

AAPL     0.373477
GOOGL    0.408194
IBM      1.000000
MSFT     0.496248
dtype: float64

Compute the correlation between returns and volume for each stock

In [81]:
returns.corrwith(volume)

AAPL    -0.103108
GOOGL   -0.030220
IBM     -0.193308
MSFT    -0.099493
dtype: float64

Run next cell to create a series 'ob'

In [82]:
#
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

Return the unique values of obj

In [83]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

Count the occurence of each value in obj

In [84]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

Return the rows of 'b' or 'c' from obj

In [85]:
mask = obj.isin(['b', 'c'])
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Run next cell to create a series 'data'

In [86]:
#
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

Remove NaN from data

In [87]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

Run next cell to create a DataFrame 'data'

In [88]:
#
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Drop a row in data if any NaN is in that row

In [89]:
data.dropna(how='any')

     0    1    2
0  1.0  6.5  3.0

Now drop a row in data if all elements in that row is NaN

In [90]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Now do the questions again but only drop by columns

In [91]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [92]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Run next cell to create a DataFrame df

In [93]:
#
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df

          0         1         2
0 -0.218654       NaN       NaN
1 -0.027196       NaN       NaN
2 -1.601697       NaN       NaN
3  0.042458       NaN  1.556476
4 -1.588454       NaN -0.794233
5 -0.103416 -0.391992 -0.960633
6  1.611803 -0.521331 -0.199077

For DataFrame df, drop a line if has less than 2 non-NaN values

In [94]:
df.dropna(thresh=2)

          0         1         2
3  0.042458       NaN  1.556476
4 -1.588454       NaN -0.794233
5 -0.103416 -0.391992 -0.960633
6  1.611803 -0.521331 -0.199077

Fill missing values in df as 0

In [95]:
df.fillna(0)

          0         1         2
0 -0.218654  0.000000  0.000000
1 -0.027196  0.000000  0.000000
2 -1.601697  0.000000  0.000000
3  0.042458  0.000000  1.556476
4 -1.588454  0.000000 -0.794233
5 -0.103416 -0.391992 -0.960633
6  1.611803 -0.521331 -0.199077

Fill missing value in column '1' as 0.5, and column 2 as 0.6

In [96]:
df.fillna({1:0.5, 2:0.6})

          0         1         2
0 -0.218654  0.500000  0.600000
1 -0.027196  0.500000  0.600000
2 -1.601697  0.500000  0.600000
3  0.042458  0.500000  1.556476
4 -1.588454  0.500000 -0.794233
5 -0.103416 -0.391992 -0.960633
6  1.611803 -0.521331 -0.199077

Repeat last step but modify df directly instead of returning a new object

In [97]:
df.fillna({1:0.5, 2:0.6}, inplace=True)
df

          0         1         2
0 -0.218654  0.500000  0.600000
1 -0.027196  0.500000  0.600000
2 -1.601697  0.500000  0.600000
3  0.042458  0.500000  1.556476
4 -1.588454  0.500000 -0.794233
5 -0.103416 -0.391992 -0.960633
6  1.611803 -0.521331 -0.199077

Run the next cell to create DataFrame 'frame'

In [98]:
#
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

Give index names of ['key1', 'key2'], and give columns names of ['state', 'color']

In [99]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

Return data of frame that state is Ohio and key1 is a

In [100]:
frame['Ohio'].loc['a']

color  Green  Red
key2
1          0    1
2          3    4

Return data of frame that state is Ohio and key1 is 'a' and key2 is 1

In [101]:
frame['Ohio'].loc['a', 1]

color
Green    0
Red      1
Name: (a, 1), dtype: int64

Swap key1 and key2 in frame

In [102]:
frame.swaplevel(0, 1, axis=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

Swap state and color in frame

In [103]:
frame.swaplevel(0, 1, axis=1)

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

Run the next cell to create a DataFrame 'frame'

In [104]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

Move c and d to labels, and return the result as frame2

In [105]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

Now do the opposite operation: move c and d back to columns

In [106]:
frame2.reset_index().sort_index(axis=1)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3